#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: Proyecto ICCD332 Arquitectura de Computadores
#+date: 2024-08-07
#+author: Luis Lema
#+author: Mijael Molina
#+email: luis.lema@epn.edu.ec
#+language: es
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.7.5)
#+cite_export:
** Descripción del código
En esta sección se debe detallar segmentos importantes del código
desarrollado así como la **estrategia de solución** adoptada por el
grupo para resolver el problema. Divida su código en unidades
funcionales para facilitar su presentación y exposición.

Lectura del API
#+begin_src python :session :results output exports both
import requests
import csv
from datetime import datetime

API_KEY = "8000de0e0248108140e1bde34fbb45e1"
# Coordenadas de Beijing
LAT = 39.907501
LON = 116.397232
# URL del API
URL = f'https://api.openweathermap.org/data/2.5/weather?lat={LAT}&lon={LON}&appid={API_KEY}&units=metric'

try:
    response = requests.get(URL)
    response.raise_for_status()  # Lanza un error si la respuesta no es 200 OK
    data = response.json()  # Convierte la respuesta en formato JSON
except requests.exceptions.RequestException as e:
    print(f"Error en la solicitud al API: {e}")

#+end_src

#+RESULTS:
: Python 3.12.5 | packaged by conda-forge | (main, Aug  8 2024, 18:36:51) [GCC 12.4.0] on linux
: Type "help", "copyright", "credits" or "license" for more information.
: >>> python.el: native completion setup loaded

Puede tener que borrar los dos puntos para que el resultado aparezca
en el HTML. En mi caso no fue necesario. Pruebe.







Convertir /Json/ a /Diccionario/ de Python
#+begin_src python :session :results output exports both
 if data.get('cod') != 200:
        raise Exception(f"Error en la solicitud: {data.get('message')}")
    
    temperature = round(data['main']['temp'], 2)
    humidity = data['main']['humidity']
    description = data['weather'][0]['description'].capitalize()
    timestamp = datetime.now().strftime('%Y-%m-%d %H:%M:%S')

    formatted_temperature = f"{temperature:.2f} °C"
    formatted_humidity = f"{humidity} %"
#+end_src


Guardar el archivo csv
#+begin_src python :session :results output exports both
def format_row(timestamp, temperature, humidity, description):
    return f"{timestamp} | {temperature} | {humidity} | {description}"

def save_to_csv(header, row, file_path):
    try:
        with open(file_path, 'a') as file:
            if file.tell() == 0:
                file.write(' | '.join(header) + '\n')
            file.write(row + '\n')
    except IOError as e:
        print(f"Error al guardar el archivo CSV: {e}")

header = ['Timestamp', 'Temperature (°C)', 'Humidity (%)', 'Description']
row = format_row(timestamp, formatted_temperature, formatted_humidity, description)

file_path = '/home/luis/BeijingWeather/clima-Beijing-hoy.csv'
save_to_csv(header, row, file_path)
#+end_src



** Muestra Aleatoria de datos
Presentar una muestra de 10 valores aleatorios de los datos obtenidos.
#+caption: Lectura de archivo csv
#+begin_src python :session :results output exports both
import os
import pandas as pd
# lectura del archivo csv obtenido
csv_file= '/home/luis/BeijingWeather/clima-Beijing-hoy.csv'

# Cargar el DataFrame desde un archivo CSV
df = pd.read_csv(csv_file)

# Limpia las columnas eliminando las unidades si es necesario
df['Temperature (°C)'] = df['Temperature (°C)'].str.replace(' °C', '', regex=False).astype(float)
df['Humidity (%)'] = df['Humidity (%)'].str.replace(' %', '', regex=False).astype(float)

# Convierte 'Timestamp' a datetime
df['Timestamp'] = pd.to_datetime(df['Timestamp'], errors='coerce')

# Muestra una muestra aleatoria de 10 valores del DataFrame
sample_df = df.sample(n=10, random_state=1)  # random_state para reproducibilidad

# Imprime la muestra en formato de tabla
print(sample_df)
#+end_src

#+RESULTS:
#+begin_example
              fecha y hora del reporte (UTC)  ...  id de la ciudad
4             2024-08-14 00:21:54  ...          1816670
9             2024-08-14 01:05:01  ...          1816670
26            2024-08-14 03:23:34  ...          1816670
27            2024-08-14 03:22:08  ...          1816670
20            2024-08-14 02:37:29  ...          1816670
12            2024-08-14 01:35:53  ...          1816670
5             2024-08-14 00:45:01  ...          1816670
8             2024-08-14 01:05:01  ...          1816670
15            2024-08-14 01:40:02  ...          1816670
3             2024-08-14 00:21:54  ...          1816670
#+end_example

Resultado del número de filas y columnas leídos del archivo csv
#+RESULTS:
: (10, 19)
#+caption: Despliegue de datos aleatorios
#+begin_src python :session :exports both :results value table :return table
table1 = df.sample(10)
table = [list(table1)]+[None]+table1.values.tolist()
#+end_src

#+RESULTS:

